const taxonomy = {
    "生灵集韵": { 
        "羽衣霓裳": ["燕羽灰","鹤灰","百灵鸟灰","山鸡黄","山鸡褐","鹦鹉冠黄","金莺黄","鸽蓝","鸥蓝","孔雀蓝","翠蓝","樫鸟蓝","鹞冠紫","鹅冠红","鹅掌黄","乳鸭黄","燕颔红","燕颔蓝","雁灰"],
        "走兽毛皮": ["鼬黄","虎皮黄","鹿皮褐","麂棕","驼色","银鼠灰","松鼠灰","猴毛灰","貂紫","猪肝紫","鼠鼻红","鼠背灰","兔眼红","海象紫","牛角灰","水牛灰","铁棕","金驼","龟背黄","玳瑁黄","苍蝇灰","河豚灰"],
        "水族鳞介": ["鲑鱼红","金鱼紫","龙睛鱼红","龙睛鱼紫","鱼鳃红","虾壳青","蟹壳红","蟹壳灰","蟹壳绿","蟹蝥红","蚌肉白","海螺橙","法螺红","珠母灰","珍珠灰","螺甸紫","海参灰","沙鱼灰","鲸鱼灰","鱼尾灰","鲛青","青蛤壳紫","尼罗蓝","海军蓝"],
        "虫豸微光": ["蜻蜓红","蜻蜓蓝","蝶翅蓝","美蝶绿","蛛网灰","淡茧黄","蜴蜊绿","龟背黄","蛙绿","蟾绿","田螺绿","海螺橙"]
    },
    "山川风物": {
        "云霞雾霭": ["晨曦红","晓灰","落霞红","夕阳红","霞光红","极光红","虹蓝","晚波蓝","暮云灰","黄昏灰","夜灰","月白","月影白","星蓝","星灰","满天星紫","云水蓝","云山蓝","云峰白","夏云灰","晴山蓝","天蓝","海天蓝","蔚蓝","苍蓝","远天蓝","冰山蓝","闪蓝","景泰蓝","井天蓝","睛蓝","鸢尾蓝","牵牛花蓝","飞燕草蓝","羽扇豆蓝"],
        "山水石色": ["潭水绿","涧石蓝","湖水蓝","秋波蓝","潮蓝","清水蓝","瀑布蓝","海涛蓝","暗海水绿","深海绿","海王绿","亚丁绿","浪花绿","飞泉绿","嘉陵水绿","远山紫","晴山蓝","云山蓝","石绿","石竹紫","石竹红","大理石灰","石板灰","磨石紫","卵石紫","岩石棕","赭石","沙石黄","玉鈫蓝","胆矾蓝","甸子蓝","鷃蓝"],
        "大地泥土": ["土黄","沙石黄","尘灰","赭石","火岩棕","火山棕","火泥棕","暗驼棕","酱棕","栗棕","驼色","鹿皮褐","岩石棕","石板灰","瓦灰","瓦罐灰","陶瓷红","釉蓝","中灰驼","芒果棕"],
        "矿物珍宝": ["雄黄","藤黄","银朱","朱红","赭石","石绿","铜绿","钴蓝","群青","靛青","花青","铅灰","铁棕","钢蓝","钢青","金黄","金驼","金叶黄","金莺黄","金盏黄","银灰","银白","银鱼白","玉红","玉粉红","玉髓绿","玉簪绿","汉白玉","象牙白","宝石蓝","宝石绿","琥珀黄","珊瑚红","玛瑙灰","珍珠灰","珠母灰","晶石紫","尖晶玉红","姚黄","硫华黄","浅烙黄","象牙黄","杏仁黄","茉莉黄","香水玫瑰黄","素馨黄","向日葵黄","初熟杏黄"]
    },
    "人间烟火": {
        "珍馐美馔": ["米色","炒米黄","豆汁黄","大豆黄","谷黄","麦秆黄","乳白","酪黄","蛋壳黄","鸡蛋黄","乳鸭黄","肉色","淡肉色","醉瓜肉","荔肉白","莲子白","藕荷","豆沙","淡豆沙","咖啡","淡咖啡","可可棕","淡可可棕","蜜黄","麦芽糖黄","姜黄","芥黄","桂皮淡棕","甘草黄"],
        "瓜果甜香": ["柠檬黄","柚黄","芒果黄","香蕉黄","木瓜黄","枇杷黄","杏黄","雅梨黄","莱阳梨黄","金瓜黄","北瓜黄","橙皮黄","橘橙","淡橘橙","佛手黄","榴萼黄","榴花红","柿红","枣红","樱桃红","草莓红","覆盆子红","无花果红","菠萝红","苹果红","无花果红","葡萄紫","葡萄酱紫","葡萄酒红","甘蔗紫","李紫","桃红","初桃粉红","海棠红","山黎豆红","嫩菱红","荸荠紫","芡食白","落英淡粉","瓜瓤粉","玫瑰粉","美人焦橙","金莲花橙","润红","野蔷薇红","余烬红","火砖红","绀红","瓜瓤红","芙蓉红","莓酱红","洋水仙红","谷鞘红","桂红","粉红","榴子红","合欢红","香叶红","艳红","牡丹粉红","山茶红","莓红","枫叶红","苋菜红","烟红","草珠红","品红","菠根红","石蕊红","玫瑰红","玫瑰紫","藤萝紫","苋菜紫","马鞭草紫","野葡萄紫"],
        "茶酒清酿": ["碧螺春绿","茶褐","咖啡","葡萄酒红","甘蔗紫","米色","酪黄"],
        "器用织造": ["陶瓷红","釉蓝","搪磁蓝","景泰蓝","古铜褐","古铜绿","古铜紫","铜绿","铁棕","钢蓝","铅灰","金黄","银灰","象牙白","汉白玉","珍珠灰","玳瑁黄","螺甸紫","墨紫","淡松烟","古鼎灰","篾黄","葵扇黄","风帆黄","软木黄","棕榈绿"]
    },
    "素色流年": {
        "雪月霜白": ["雪白","象牙白","汉白玉","银白","鱼肚白","云峰白","月影白","荷花白","菊蕾白","蚌肉白","荔肉白","莲子白","芡食白","粉白","珠母灰","珍珠灰"],
        "烟雨迷蒙": ["月灰","星灰","浅灰","中灰","深灰","瓦灰","夜灰","雁灰","铅灰","银灰","淡铁灰","钢蓝","鹤灰","燕羽灰","蟹壳灰","橄榄灰","海鸥灰","斑鸠灰","松鼠灰","猴毛灰","蛛网灰","芦灰","芦穗灰","尘灰","垩灰","镍灰","明灰","绿灰","淡绿灰","淡蓝灰","灰蓝","深灰蓝","黄昏灰","暮云灰","晓灰","海报灰","玫瑰灰","淡玫瑰灰","隐红灰","中红灰","玛瑙灰","古鼎灰","锌灰","战舰灰","瓦罐灰","青灰","牛角灰","水牛灰","海参灰","沙鱼灰","鱼尾灰","鲸鱼灰","百灵鸟灰","大理石灰","石板灰","苍蝇灰","河豚灰","嫩灰","狼烟灰","长石灰"],
        "初曙暮色": ["米色","淡肉色","肉色","淡米粉","淡豆沙","淡赭","淡土黄","浅驼色","淡咖啡","淡可可棕","淡栗棕","淡铁灰","淡银灰","淡灰绿","淡蓝灰","淡绿灰","淡茜红","淡菽红","淡曙红","淡绯","淡蕊香红","淡绛红","淡玫瑰灰","淡牵牛紫","淡青紫","淡蓝紫","淡藤萝紫","淡藏花红","淡桃红","淡罂粟红","淡密黄","淡橘橙","淡松烟","淡翠绿","淡绿","穹灰", "淡赭","淡茧黄"]
    },
    "古韵丹青": {
        "丹砂朱磦": ["银朱","朱红","大红","胭脂红","丹紫红","赭石","铁水红","红汞红","曲红","舌红","颊红","柿红","榴花红","鹤顶红","鹅血石红"],
        "藤黄石黄": ["藤黄","雄黄","土黄","姜黄","栀子黄","槐花黄绿","黄连黄","金黄","杏黄","蜜黄","琥珀黄"],
        "石青石绿": ["石绿","群青","花青","靛青","景泰蓝","铜绿","孔雀蓝","孔雀绿","宝石绿","碧青","霁青","天蓝","柏林蓝","海青","钴蓝","品蓝","安安蓝","釉蓝"],
        "墨紫檀褐": ["墨紫","檀紫","古铜紫","绀紫","乌梅紫","暗玉紫","暗蓝紫","暗龙胆紫","暗驼棕","暗海水绿","暗蓝","深灰","深牵牛紫","深灰蓝","深海绿","暗紫苑红","殷红","猪肝紫","酱紫","栗紫","葡萄酱紫","貂紫","茄皮紫","菜头紫","洋葱紫","李紫","卵石紫","磨石紫","火鹅紫","晶石紫","剑锋紫","龙葵紫","荸荠紫","古鼎灰","铁棕","火岩棕","橡树棕","椰壳棕","柞叶棕","凋叶棕","鹿角棕","玳瑁黄","龟背黄","苍黄"]
    },
    "花木芳华": {
        "春华夭夭": [ "新禾绿","嫩菊绿","芽绿","蔻梢绿","麦苗绿","春梅红","初荷红","报春红","樱草紫","丁香淡紫","淡藤萝紫","淡青紫","豆蔻紫","扁豆紫","芥花紫","山梗紫","野菊紫","满天星紫","剑锋紫","龙葵紫","晶石紫","淡蓝紫","远山紫","螺甸紫","淡牵牛紫","凤信紫","萝兰紫","芝兰紫","槿紫","蕈紫","桔梗紫","魏紫","葛巾紫","牵牛紫","芓紫","青莲","玉簪绿","嫩菱红","白芨红","酢酱草红","初桃粉红","介壳淡粉红","淡藏花红","粉团花红","夹竹桃红","莲瓣红","水红","月季红","松叶牡丹红","锦葵红","吊钟花红","紫荆红","扁豆花红","石竹红","草茉莉红","茶花红","枸枢红","秋海棠红","丽春红","唐菖蒲红","鹅冠红","凤仙花红","榲桲红","姜红","豇豆红","霞光红","喜蛋红","山黎豆红","蓟粉红","菱锰红","龙须红","电气石红","晶红","藏花红","芍药耕红","落英淡粉","瓜瓤粉","玫瑰粉","野蔷薇红","余烬红","火砖红","绀红","瓜瓤红","芙蓉红","莓酱红","洋水仙红","谷鞘红","桂红","粉红","榴子红","合欢红","香叶红","艳红","牡丹粉红","山茶红","莓红","枫叶红","苋菜红","烟红","草珠红","品红","菠根红","石蕊红","玫瑰红","玫瑰紫","藤萝紫","苋菜紫","马鞭草紫","野葡萄紫"],
        "夏荫碧绿": ["竹篁绿","荷叶绿","梧枝绿","葱绿","翠绿","明绿","田园绿","淡翠绿","莽丛绿","苷蓝绿","苍绿","油绿","鹦鹉绿","宫殿绿","松霜绿","蛋白石绿","薄荷绿","瓦松绿","田螺绿","白屈菜绿","蒽油绿","槲寄生绿","云杉绿","艾背绿","嘉陵水绿","玉髓绿","鲜绿","宝石绿","海沬绿","橄榄石绿","水绿","芦苇绿","槐花黄绿","苹果绿","蝶黄","橄榄黄绿","棕榈绿","焦茶绿","古铜绿","蟹壳绿","铜绿","竹绿","蓝绿","石绿","美蝶绿","毛绿","蛙绿","碧螺春绿","苔绿","草灰绿","淡灰绿","潭水绿","橄榄绿","粽叶绿","灰绿","枯绿","暗海水绿","蜴蜊绿","青矾绿","草原远绿","粉绿"],
        "秋实金灿": ["枇杷黄","杏黄","北瓜黄","柚黄","芒果黄","香蕉黄","木瓜黄","莱阳梨黄","雅梨黄","金瓜黄","橙皮黄","榴萼黄","柿红","枣红","榴花红","葡萄紫","樱桃红","草莓红","覆盆子红","无花果红","菠萝红","苹果红","萝卜红","高粱红","满江红","金盏黄","万寿菊黄","秋葵黄","谷黄","大豆黄","麦秆黄","油菜花黄","栗棕","栗紫","槟榔综","椰壳棕","橡树棕","榲桲红","姚黄","硫华黄","浅烙黄","象牙黄","杏仁黄","茉莉黄","香水玫瑰黄","素馨黄","向日葵黄","初熟杏黄","美人焦橙","金莲花橙","润红"],
        "冬藏素净": ["枯绿","苍绿","凋叶棕","柞叶棕","淡松烟","松霜绿","云杉绿","槲寄生绿","苔绿","艾绿","蟾绿","草黄","蒿黄","姜黄","栀子黄","芥黄","苍黄","土黄","沙石黄","驼色","鹿皮褐","麂棕","岩石棕","火山棕","暗驼棕","酱棕","铁棕","淡栗棕","可可棕","丁香棕","咖啡","茶褐","古铜褐","桂皮淡棕","筍皮棕","火泥棕","橡树棕","栗棕","芒果棕","中灰驼","紫灰"]
    }
};

